In [2]:
import pandas as pd
import numpy as np
from pandas import DataFrame
from pandas import Series

In [3]:
df_1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2'],
    'C': ['C0', 'C1', 'C2'],
    'D': ['D0', 'D1', 'D2']},
    index=[0, 1, 2])
df_1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2

In [4]:
Series_1 = pd.Series(['S1', 'S2', 'S3'], name='S')
Series_1

0    S1
1    S2
2    S3
Name: S, dtype: object

In [5]:
pd.concat([df_1, Series_1], axis=1)

    A   B   C   D   S
0  A0  B0  C0  D0  S1
1  A1  B1  C1  D1  S2
2  A2  B2  C2  D2  S3

In [6]:
pd.concat([df_1, Series_1], axis=1, ignore_index=True)

    0   1   2   3   4
0  A0  B0  C0  D0  S1
1  A1  B1  C1  D1  S2
2  A2  B2  C2  D2  S3

In [7]:
Series_2 = pd.Series([0,1,2])
Series_3 = pd.Series([3,4,5])
print(Series_2)
print(Series_3)

0    0
1    1
2    2
dtype: int64
0    3
1    4
2    5
dtype: int64

In [8]:
pd.concat([Series_1, Series_2, Series_3], axis=1)

    S  0  1
0  S1  0  3
1  S2  1  4
2  S3  2  5

In [9]:
pd.concat([Series_1, Series_2, Series_3], axis=1, keys=['C0', 'C1', 'C1'])

   C0  C1  C1
0  S1   0   3
1  S2   1   4
2  S3   2   5

In [ ]:
# [Python pandas] 결측값, 원래 값을 다른 값으로 교체하기(replacing generic values) : replace()

In [11]:
ser = Series([1, 2, 3, 4, np.nan])
ser

0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
dtype: float64

In [12]:
ser.replace(2, 20)

0     1.0
1    20.0
2     3.0
3     4.0
4     NaN
dtype: float64

In [13]:
ser.replace(np.nan, 5)

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [14]:
ser.replace([1, 2, 3, 4, np.nan], [6, 7, 8, 9, 10])

0     6.0
1     7.0
2     8.0
3     9.0
4    10.0
dtype: float64

In [15]:
ser.replace({1: 6,
2: 7,
3: 8,
4: 9,
np.nan: 10})

0     6.0
1     7.0
2     8.0
3     9.0
4    10.0
dtype: float64

In [16]:
df = DataFrame({'C1': ['a_old', 'b', 'c', 'd', 'e'],
'C2': [1, 2, 3, 4, 5],
'C3': [6, 7, 8, 9, np.nan]})
df

      C1  C2   C3
0  a_old   1  6.0
1      b   2  7.0
2      c   3  8.0
3      d   4  9.0
4      e   5  NaN

In [17]:
df.replace({'C1': 'a_old'}, {'C1': 'a_new'})

      C1  C2   C3
0  a_new   1  6.0
1      b   2  7.0
2      c   3  8.0
3      d   4  9.0
4      e   5  NaN

In [18]:
df.replace({'C3': np.nan}, {'C3': 10})

      C1  C2    C3
0  a_old   1   6.0
1      b   2   7.0
2      c   3   8.0
3      d   4   9.0
4      e   5  10.0